{"toefl":["abandon","abandoned","abandonment","abbreviate","abbreviated","abbreviation","abide","abide by","abiding","ability","inability","capability","viability","variability","ablaze","blazing","abnormal","normal","normally","abolish","abolition","abolitionist","abort","abound","abrasion","abrasive","abrupt","abruptly","absenteeism","absentee","absent","absence","absolute","absolutely","absorb","absorption","abstract","abstraction","absurd","abundant","abundantly","abundance","abuse","abut","academic","academician","accelerate","accelerated","accelerating","acceleration","access","accessible","accessibility","accessory","accidental","accidentally","accident","acclaim","acclaimed","accommodate","accommodation","accommodating","accompany","accompanying","accompaniment","accomplish","accomplished","accomplishment","accordion","account","on account of","take account of","take into account","account for","accounting","accountant","accredit","accumulate","accumulated","accumulation","accurate","accuracy","accurately","inaccurate","accuse","accusation","accustomed","achieve","achievement","acid","acidic","acidity","acquaintance","acquaint","be acquaint with","acquisition","acquire","acronym","actual","actually","actuate","activate","actively","acute","acumen","adapt","adaptable","adaptation","adaptive","addict","addictive","additive","additional","in addition to","adept","adequate","inadequate","adhere","adhesive","adjacent","adjoin","adjoining","adjunct","adjust","adjustment","administer","administration","administrative","administrator","admire","admiration","admiring","admit","admittedly","adobe","adopt","adoption","adorn","adornment","unadorned","advance","advancement","advanced","advent","adventure","adventurous","adventurer","adverse","adversely","adversity","advocate","aesthetic","aesthetically","anesthetic","affect","affected","affection","affective","affectionate","affiliate","affinity","affirm","afflict","affliction","affluent","afford","affordable","agenda","aggravate","aggravating","aggregate","aggregation","aggressive","aggressiveness","agile","agility","fragile","fragility","agitation","agreeable","disagreeable","ailment","aim","air","airborne","ajar","akin","akin to","alchemy","alder","alert","algae","alien","salient","alignment","alike","all but","all but","all","allegation","allegory","alliteration","allocate","alloy","allude","ally","rally","aloft","alone","aloof","alter","alteration","alternate","alternately","alternation","alternative","altitude","latitude","platitude","aluminum","amateur","amaze","amazement","amazing","ambience","ambition","ambitious","ambivalent","ambivalence","amble","scramble","amenable","amendment","Amendment","amend","amenity n.","amid","pyramid","amnesia","amount","ample","trample","amplify","amplification","an army of","analogy","analogous","analyze","analysis","psychoanalysis","anarchist","anatomy","ancestor","ancestry","ancestral","anecdotal","anecdote","anesthesia","anesthetic","angular","rectangular","animated","annex","annihilate","announce","announcement","announcer","annoy","annoying","annual","annually","anomaly","anonymous","anthem","anthology","anthropology","antibiotic","anticipate","anticipation","antiquate","antiquated","antique","antiquity","antiseptic","anxious","anxiously","apart from","apologize","apology","apologetic","appeal","appealing","appetite","applaud","applicant","apply","application","Apply","appliance","appoint","appointment","disappointment","apportion","appraisal","appreciable","appreciate","appreciation","apprentice","approach","approaching","appropriate","appropriately","appropriation","approve","approval","disapproval","approximate","approximately","apt","aptly","aquatic","aquarium","arbitrary","Arbitrarily","arboreal","arc","archaeology","archaeological","archipelago","architect","architecture","architectural","ardent","arduous","arena","aria","arid","semiarid","arithmetic","armor","armored","arms","armory","aroma","aromatic","arouse","arrange","arrangement","array","arsenal","arthritis","article","particle","articulate","particulate","artificial","Artificially","artisan","as far as","as such","as a rule","as a rule of thumb","ascend","ascending","ascent","ascribe","aspect","aspiring","aspiration","assault","assemble","assembly","assembly line","assemblage","assert","assess","assessment","asset","cassette","videocassette","assignment","assimilate","assistant","assist","assistance","assistantship","associate","association","assorted","assortment","assume","assumption","assure","assuredly","reassure vt.","astonish","astonished","astonishing","astound","astounding","astronomical","astronomy","astronomer","astute","asymmetrical","at intervals","at one session","at the cutting edge of","atheist","theist","athlete","atmosphere","atom","atomic","atomization","atrophy","attachment","attach","attached","attain","attainment","attempt","attend","attendant","attendance","attention","attire","attorney","attract","attraction","attractive","attribute","audible","audit","audience","auditorium","audition","auger","augment","aurora","authentic","authenticate","authority","authorize","autobiography","autobiographical","biography","automated","automatic","automatically","autonomy","autonomous","auxiliary","available","avalanche","avant-garde","average","aversion","averse","avert","aviation","aviator","avid","avocation","avocational","avoid","avoidable","avoidance","awareness","awkward","awkwardly","axis","baby-sitter","bachelor","back and forth","backbone","backdrop","baggage","balance","balanced","imbalance","overbalance","bald","bald eagle","ballet","balloon","balloonist","balmy","ban","banner","banker","bang","Cuban","band","bandleader","bandmaster","bandanna","bankruptcy","bankrupt","bar","snack bar","barb","barbed wire","barbecue","barber","bare","barely","barge","bark","barn","baroque","barrel","barren","barrenness","barrier","barter","basement","basin","be taken by","be up to","bead","beaded","beak","beam","girder","bear","unbearable","forebear","beard","beat","bedrock","behalf","behave","behave oneself","behavior","belie","believe in","bellows","below","belong to","beneath","benefit","beneficial","benign","bequest","besides","besiege","bestow","betray","beverage","bias","unbiased","bicameral","bilateral","bill","hillbilly","billion","biography","autobiography","biographer","biologist","biological diversity","bison","bitter","bitterness","bizarre","blame","bland","blanket","blast","blast furnace","blazing","blaze","ablaze","bleach","bleak","blend","blessing","blink","blizzard","block","bloom","blossom","blues","bluff n.","blunt","blush","board","aboard","boarder","boardinghouse","keyboard","cupboard","boast","boastful","boiling point","bold","bolster","bonanza","bond","boom","baby boom","boon","baboon","boost","boring","boredom","bore","boulder","bounce","bound","boundary","boundless","bouquet","bow","bowlegged","bowl","elbow","rainbow","braid","brain","brawl","brawling","breach","break apart","break all ties with","break out","breakdown=break down","breakup","break up","breathless","breathing","breath","breathe","breathtaking","breed","crossbreeding","breeze","brighten","brilliance","brilliantly","brim","broad-brimmed","briny","brisk","briskness","brittle","broaden","brochure","bronze","Bronze Age","sun-bronzed","brook","brown","brownish","bubble","buckle","bud","buddy","budget","buggy","building block","bulb","bulk","bulky","bump","bunch","bundle","burdensome","burgeon","burning","burrow","bush","bust","combustion","combustible","robust","statue","bustle","butter","buzz","buzzer","by a factor of","by chance","by far","by-product","cab","taxicab","the Cabinet","cabinet","cabinetmaker","cabin","log cabin","cacti","cadence","calculate","calculation","calculator","calibration","calm","campaign","champion","championship","cancel","cancellation","Cancelled","candid","Candidly","candidate","cannibalism","canopy","canvas","canyon","capability","capable","capacity","captivity","carapace","carat","carbohydrate","cardiac","cardinal","career","careerism","careless","carelessly","careful","cargo","caricature","carnival","carnivorous","carve","carver","carving","cast","casting","cast-iron","cast off","cast away","forecast","broadcast","rebroadcast","newscast","overcast","casual","catalyst","catalyze","catastrophe","catching","eye-catching","catch on","categorize","category","cater","caterpillar","cathedral","cause","cautious","cautiously","caution","cavern","cavity","cease","ceaseless","celebrated","celebrate","celebrity","celestial","cell","cellist","cello","census","centennial","centigrade","ceremonial","ceremony","chafe","chagrin","chalk","chamber","chamber music","champion","championship","chaos","chaotic","chapel","character","characteristic","characterize","be characterized by","charcoal","charitable","charter","chart","chaste","chat","chateau","check","checkup","checkout","check out","paycheck","chef","cherish","chill","chilly","chilli","chimpanzee","gorilla","chisel","chivalry","choke","chop","choppy","chord","chore","choreography","choreograph","choreographer","choreographic","chorus","chronic","chronological","chronology","chubby","chunk","cider","cipher","circuit","closed circuit","circular","circle","circulate","circulation","circulation desk","circumference","circumscribe","circumstance","citadel","cite","citizenship","civil","civil rights","civil war","civility","civilization","civilian","claim","clam","clamor","reclamation","clan","clap","clarify","clarification","classify","classification","clause","clay","clergy","clergyman","cliff","climate","climatic","cling","clinic","clinical","clip","clockwise","counterclockwise","clog","clumsy","cluster","clutch","coalesce","coalescence","coalition","coarse","coax","code of laws","codify","coexist","cognitive","coherent","coherence","incoherence","cohesion","cohesive","coil","recoil","coin","coinage","coincide","coincident","coincidence","collaborate","collaboration","collapse","colleague","collective","collide","collision","colloquial","colloquialism","colonize","colony","colonial","colonel","colossal","combination","combine","combustible","combustion","comet","cometary","comic","comical","commander","commemorate","comment","commentator","commentary","commerce","commercial","commercialize","commission","commissioner","committed","commit","committee","commitment","commodity","commonsense","commonplace","communal","communicate","communication","community","commute","commuter","telecommuter","compact","compaction","companion","comparable","comparative","comparatively","compatible","incompatible","compel","Compelling","compensate","compensation","compensatory","compete","competent","competence","competition","competitiveness","competing","compile","complacence","complaint","complain","complement","complementary","complex","complexity","complicated","complication","complicity","complimentary","compliment","comply with","component","compose","be composed of","recompose","composition","decomposition","compound","compound eyes","comprehend","comprehensible","comprehension","comprehensive","compress","compression","compressed","comprise","compromise","compulsory","compute","computation","concave","conceal","concede","conceive","concentric","concept","conception","misconception","conceptual","concert","concerted","concerto","concise","conciseness","conclude","conclusive","inconclusive","concomitant","concrete","concurrent","condemn","condemnation","condensation","condense","condenser","condiment","condition","air conditioner","conditioning","condor","conduct","conductivity","conductor","cone","confederate","confederacy","confer","(confer sth. on","conference","confess","confession","confide","confident","confidence","overconfident","configuration","confine","confined to bed","confining","confinement","confirm","confirmation","conflict","conflicting","confluence","conform","conformity","nonconformity","nonconformist","confront","confuse","confuse…with…","confusion","congenial","congenital","congestion","congested","congratulation","congregate","conglomerate","congress","congressional","congressman","conifer","conjectural","conjecture","connect","connection","disconnect","connoisseur","conscience","conscientious","conscious","consciously","consciousness","unconscious","consecutive","consequence","consequent","consequently","conservative","conservatism","conserve","conservation","conservationist","considerable","considerably","considerate","consideration","consistent","consistency","consistently","consonant","consort","consortium","conspicuous","Conspicuously","conspiracy","constant","constantly","constellation","consternation","constituent","constitution","constitute","constitutional","constrain","constraint","constrict","constricted","construct","construction","consult","consultant","consume","consumer","consumption","contact","contagious","contain","container","contaminate","contamination","contemplate","contemporary","contender","contention","content","contented","context","contiguous","contagious","continent","continental","supercontinent","transcontinental","continuation","continuity","continuum","contour","contract","contraction","contractor","contradict","contradictory","contrary","contrast","contribute to","controversy","controversial","convenient","inconvenient","convenience","convention","conventional","conventionally","unconventional","converge","conversation","conversational","converse","conversant","conversion","convert","converter","convex","convict","conviction","convincing","unconvincing","convinced","convivial","cooperate","cooperation","cooperative","coordinate","coordinated","coordination","copper","coral reef","reef","core","crust","mantle","corps","correlate","correlated","correspondence","corrosion","corrosive","rodent","corruption","cosmic","cosmopolitan","costume","counsel","counseling","counselor","counteract","counterbalance","counterclockwise","counterfeit","counterpart","countless","couple","coupled","courier","court","courthouse","courtship","courtly","courteously","cover","coverage","cowhand","cowboy","cozy","crab","crack","craft","craftspeople","hovercraft","aircraft","spacecraft","cram","cramped","scramble","crash","crater","crawl","crayon","canyon","crazy","credence","credentials","credit","creditor","creek","creep","crevice","crew","screw","screwdriver","crimson","cripple","crippling","crisscross","the Red Cross","crossbones","crosscut","crossing","crossbreeding","critical","critical point","critique","crooked","crow","Crowd","Overcrowd","crown","Crowbar","Crucial","crude","Cruelty","crude oil","crumple","crumble","crush","crust","crustacean","crystal","crystalline","crystallize","crystallized","crystallization","cubism","cube","cubic","cue","barbecue","culinary","culminate","cultivate","cultivation","culture","horticulture","agriculture","cumbersome","curator","curious","curiosity","currency","current","currently","concurrent","curriculum","cushion","a cushion of","air-cushion vehicle","custodian","custom","customs","customer","customarily","accustomed","cuticle","cylinder","dagger","daisy","damp","dampen","dangerous","daring","dart","dash off","date","date back","dated","outdated","validate","inundate","daunting","dawn","dawning","dazzling","deadly","deal","a great deal","a good deal","big deal","deal with","debatable","debate","debris","debt","debtor","decadent","decay","deceive","decent","deceptive","deception","deciduous","decimal","deck","declaration","declare","decline","decomposition","decompose","decorate","decoration","decorative","decrease","defecate","defect","defective","defend","defense","defensive","defer","deferential","deference","deficiency","deficient","deficit","definite","definitely","definitive","definition","deform","deformation","deft","adept","degrade","degradation","dehydrate","dehydrated","dehydration","deign","deity","delay","delectable","delegate","deliberate","deliberately","delicate","delicious","delirium","delta","demobilize","immobilize","democracy","demolish","demolition","demonstrate","demonstration","denomination","denote","denounce","dense","condense","condenser","density","dent","indent","indenture","rodent","edentate","dentistry","dental","dentist","deny","depart","departure","dependent","depend on","dependence","dependable","independent","interdependent","depict","deplete","deposit","depositor","depot","depreciation","depredation","depress","depressed","under the depressor","depression","deprive","deprivation","derive","derive from","derivative","desalination","descend","descendant","descent","desert","deserted","deserve","undeserved","designate","desire","desirable","desolate","desperate","desperately","despoil","despoiler","dessert","destination","destine","destruction","destructive","detect","detective","detectable","smoke detector","deter","deterrent","detergent","deteriorate","determinant","determine","determination","determinedly","detest","detrimental","detriment","devastate","devastation","devastating","device","devise","devoid","devote","devotion","devour","diagnose","diagonal","diagonally","diagram","dialect","dialogue","diameter","dictate","diction","prediction","jurisdiction","diet","dietary","dieter","dietitian","dietetics","differentiate","undifferentiated","diffuse","digestion","digest","digestive","indigestion","dignity","digression","dilate","dilemma","diligent","diligently","dilute","dilution","dim","dimly","dime","dimension","dimensional","two/three dimensional","diminish","dinosaur","dioxide","carbon dioxide","diplomacy","diplomatic","disadvantage","disapproval","disaster","disastrous","discard","discern","discernible","discerning","discharge","disciple","discipline","subdiscipline","disciplined","discomfort","discontented","discontent","discount","discourage","discouraging","discourse","discrete","discreet","disgust","disgusted","disillusion","disintegrate","disinterested","dismal","dismay","dismember","dismembered","dismiss","disorganize","dispatch","dispense","dispense with","disperse","dispersal","displace","displacement","display","disposal","dispose of","disposed","disposition","disproportionate","dispute","disregard","disrepute","disrupt","disseminate","dissenter","dissenting","dissertation","dissimilar","dissipate","dissipated","dissolve","distant","distance","distend","distent","distasteful","distill","distinction","distinct","distinctly","distinctive","distinctively","distinguish","distinguished","distort","undistorted","distortion","distract","distress","distribute","distribution","district","disturb","undisturbed","disturbance","dive","diver","divergent","divergence","diverse","diversity","diversify","diversified","diversification","diversion","divert","divide","dividing line","divorce","dizzy","dizzying","dizziness","doctrine","documentation","document","documentary","dogged","dogma","doll","dolphin","domain","domestic","domesticate","domesticated","dominant","predominantly","dominate","predominate","donate","donation","donor","dormant","dormitory","dorsal","dot","endotoxin","endotherm","doubt","doubtful","downtown","draft","draft animal","drag","dragonfly","drain","down the drain","drainage","drama","dramatize","melodrama","dramatically","dramatic","drastic","draw","drawing","draw up","draw out","draw from","drawback","drawer","dread","dreadful","dreadfully","dreary","drift","driftwood","snowdrift","drill","drop in","drought","drowsy","drudgery","ductile","due","due to","overdue","dues","subdue","residue","dull","dumb","dumbbell-like","dump","duplicate","durable","duration","dwarf","dwell","dweller","dwelling","dye","dynamic","dynamics","aerodynamics","thermodynamics","eager","earthquake","eccentric","eccentricity","eclecticism","eclipse","solar eclipse","lunar eclipse","ecological","ecologist","economical","economics","economize","ecosystem","edge","edentate","edible","edifice","educable","educated","education","effective","effectiveness","efficient","efficiency","effluent","eject","elaborate","elaborately","elasticity","inelastic","election","selection","electron","elegant","elegance","element","elementary","elevate","elevation","elevator","elicit","eligible","eliminate","elimination","elite","elixir","elliptical","elongate","eloquent","elusive","emancipate","emancipation","embarrass","embed","embellish","embellishment","emblem","embody","emboss","embrace","embroider","embroidery","embryo","embryological","embryonic","emerge","emerging","emergence","emigrant","eminent","eminence","preeminent","emission","emit","emotional","emotion","emphasize","emphasis","employ","employee","employer","empty","enactment","encase","enclose","enclosure","encompass","encounter","encourage","encroach","encyclopedia","endanger","endangered","endeavor","endless","endlessly","endow","endowment","endure","enduring","endurance","energetic","engaging","engage in","engrave","engraving","enhance","enlightenment","enormous","enrage","enrich","ensemble","entanglement","enterprise","enterprising","entertain","entertainment","entertainer","enthusiasm","enthusiastically","entitle","entitled","entity","entrenched","entrepreneur","entry","envelop","envious","envision","enzyme","ephemeral","epic","epidemic","epidermis","episode","epoch","equal","equality","equilibrium","equipment","equitable","equivalent","eradicate","erect","erode","erosion","erratic","erratically","error","eruption","erupt","escalate","escalator","escape","escapist","essential","estate","real estate","estimate","underestimate","overestimate","eternal","eternally","ethics","ethically","ethnic","etiquette","evaluate","evaporate","evaporation","eventful","eventual","eventually","evergreen","evidence","evident","eviscerate","evoke","evolution","evolve","evolutionary","exact","exacting","exaggerate","exaggeration","exalted","excavate","excavation","exceed","excel","excellent","exception","exceptional","exceptionally","excess","excessive","exchange","excitement","excite","exciting","exclaim","exclude","exclusion","exclusive","exclusively","excursion","excuse","execute","execution","executive","exemplary","exemplify","exempt","exempt from","exemption","exert","exertion","exhale","exhaust","exhausted","exhausting","exhibit","exhibition","exhilarating","exhilarate","exit","exorbitant","exotic","expand","expanding","expansion","expanse","expedition","expel","expenditure","expertise","expire","explicit","implicit","explode","exploit","exploitation","explore","explorer","exploration","explosive","exponential","exposition","exposure","express business","express train","expressive","expressly","extension","extend","extended","extensive","exterior","exterminate","external","extinct","extinction","extol","extract","extraordinary","extraordinarily","extremity","exuberant","eyewitness","fable","fabric","facade","facet","multifaceted","face","facilitate","facilitation","facility","facsimile","faction","petrifaction","satisfaction","factor","factual","faculty","fade","faint","faintly","fairly","faithful","faithfulness","fake","falcon","falconer","famine","fanatical","fanatic","fanaticism","fancy","fanciful","infancy","fantastic","fantasy","far-reaching","farce","fascinate","fascinating","fascination","fashionable","fashion","fasten","fatal","fateful","fatigue","faucet","fault","fauna","flora","floral","favorable","favored","unfavorable","feasible","feat","feeble","feed","feeder","feed on","feminism","feminist","fencing","fend for oneself","fender","ferment","fermentation","ferry","fertile","infertile","fertilize","fertilized egg","fertilizer","fervor","festive","festival","feud","feudal","feverish","feverishly","fiber","fiction","nonfiction","fictional","fidelity","field research","fierce","figurehead","file","profile","filter","finance","financial","financing","finch","finesse","fir","firm","firmly","fishy","fitness","fittingly","fixed","fixture","flabby","flag","flagella","camouflage","flair","flake","snowflake","flamboyant","flare","flash","flashlight","flavor","flavoring","flea","fleeting","flexible","flexibility","flickering","flint","float","flock","flock to","flora","flounder","flourish","fluctuate","fluctuation","fluent","fluffy","fluorescent","flux","influx","foe","fog","foghorn n.","fogged","foggy","fold","folding","scaffolding","thousandfold","unfold","foliage","folklore","follow suit","folly","foment","foolish","footnote","forage","foray","forbid","forbidding","ford","Ford","forebear","forecast","forefather","forefront","foremost","forerunner","foresee","foresight","foreshadow","forestall","foretell","forge","formal","formalized","informal","format","formation","deformation","transformation","formative","informative","former","formerly","formidable","formula","formulate","fort","fortress","fortify","fortuitous","fortuitously","fortunate","fortune","misfortune","fossil","fossilize","fossilized","foster","foul","founder","fraction","refraction","fracture","fragile","fragility","fragment","fragrant","fragrance","framework","frame","frank","fray","freight","freighter","frenetic","fanatical","frenzy","fresco","freshly","freshness","friction","frightening","frigid","fringe","frivolity","from a far","frost","defrost","frown","frugal","frugality","fruitful","fruitfulness","fruitless","fruitlessly","frustrate","frustration","frustrating","fume","perfume","fumigate","functional","malfunctional","functioning","fund","funding","fundamental","fungi","furious","furnish","furnishing","furniture","furry","further","fuse","fused","fusion","diffusion","infusion","confusion","galaxy","gallant","gallantry","gallery","galvanize","galvanization","gap","garb","garbage","gaseous","gasoline","gauge","gazette","gear","gem","gemstone","generalize","generalization","generate","generous","genesis","genetic","genetics","genetically","genial","congenial","genre","gentility","genuine","germ","get rid of","get in the way of","giant","gibe","gigantic","gilding","girder","beam","give way to","glacial","glacier","Glaciated","glamorous","gland","glandular","glare","glassware","ware","earthenware","tableware","hardware","warehouse","glazed","glaze","glean","glide","glider","glimpse","global","glorify","glossy","glowing","gnaw","go broke","goal","gold rush","gorgeous","gospel","gossip","gourmet","gourmand","govern","governor","grab","grace","graceful","disgrace","graft","grand","grandeur","granite","graphic","graph","graphics","kymograph","telegraph","stereophotograph","photograph","seismograph","lithograph","graphite","grasp","grasshopper","grateful","gravitational","gravitation","gravitational field","gravitational pull","gravitational force","gravity","graze","grazing land","grease","greedy","grind","grip","grope","grumble","guarantee","gulf","gull","gulp","gush","gust","gymnastic","gymnastics","gyration","habitat","hail","hallmark","halt","hamburger","hamper","handicap","handicraft","hands-on","handy","handful","haphazard","harbor","harden","hardware","hardy","harmful","harmless","harmonize","harmony","harmonious","harmonic","harmonica","philharmonic","harness","harsh","harshness","harvest","haste","hasten","chaste","hatch","hatchling","hatchery","hatchet","thatch","haul","haunt","haunted","haven","heaven","heavenly","hay","hazard","hazardous","hazel","haze","heal","healing","healthful","heed","heel","heighten","heir","helium","helpful","helper","helpless","hem","ham","hemisphere","herald","herculean","herd","shepherd","herder","heredity","heritage","heroism","hesitate","hestiant","heterogeneous","homogeneous","heyday","hibernate","hibernation","hide","rawhide","hierarchy","highlight","hike","hilly","chilly","hinder","hinge","hint","hinterland","hold a large stake","hoe","hollow","homemade","homespun","homogenize","homogeneous","horde","horizon","horizontal","horn","horned","hornbill","hornet","pronghorn","foghorn","thorn","thorny","horror","horror film/movie","hospitable","hostile","hostility","house","hover","hovercraft","hub","huddle","hue","humanity","humanitarian","nonhuman","humanistic","humanist","humble","humid","humidity","humiliate","humility","hummingbird","humorous","hump","hunger","hurl","hurricane","husk","hustle","hydrogen","hygiene","hypersensitive","hypothesis","hypothesize","iceberg","ice sheet","ice cream cone","icicle","icon","iconographic","identical","identify","identification","identifiable","identity","ideology","ideological","idiom","idiomatic","idyllic","igneous","ignite","ignorant","ignorance","ignore","illegible","illiterate","illuminate","illumination","illusion","illusive","illustrate","illustration","image","imaginative","imaginary","imagery","imbibe","imitate","imitation","immediate","immediately","immense","immigrant","immigration","immobile","immobilize","demobilize","immune","immune system","immunity","impact","impair","impart","impartial","impede","impediment","impending","imperative","impermeable","impersonal","impersonate","impersonation","impetus","implement","implication","implicit","imply","import","impose","imposing","impressive","imprint","imprisonment","improbable","improvise","improvision","improviser","impulse","in conjunction with","in accord with","in common","in scale","in terms of","inaccessible","inactivate","inadequate","inanimate","inappropriate","appropriate","inaugurate","incapacitate","incense","incentive","incessant","incident","incidentally","incidence","coincident","coincidence","incisive","incise","inclination","inclined","inclusive","incompatible","incomprehensible","incongruity","incongruous","incorpoarate","incorporation","incredible","incredulity","incur","indefinite","indefinitely","indent","indented","indenture","indicate","indicative","indifferent","indifference","indigestion","indiscriminate","Indiscriminately","indiscrimination","indispensable","individualism","induce","inducible","industrial","industrialization","industrialized","industrious","ineligible","inert","inevitably","inextricably","infancy","infection","infectious","inferior","inferiority","infertile","infest","infiltrate","inflate","inflation","inflexible","inflict","afflict","influential","influenza","influx","informal","informed","be informed about","infuse","infusion","ingenious","ingeniously","ingredient","inhabit","habitat","inhabitant","inherent","inherit","inheritance","inhibit","initiate","initial","initially","inject","innate","innermost","innocent","innovation","innovative","innumerable","inorganic chemical","inquiry","insanity","insert","insight","insist","insistence","inspect","inspection","inspector","inspire","inspiring","inspiration","install","installment","instantaneous","instinct","instinctive","instinctively","institute","institution","institutionalize","instructive","instruct","instruction","instrument","instrumental","instrumentalist","insulation","insulin","insult","insulting","insurmountable","intact","integral","integrate","integrated","disintegrate","integrity","intellect","intellectual","intelligent","intelligence","intelligible","intense","intensify","intensive","intentionally","intention","interaction","interact","interactive","interconnected","interconnecting","interdependence","interdependent","interest","interfere","interference","interior","interlocking","intermediate","intermittent","internal","external","interpersonal","interpretation","interrupt","intersect","intersection","interstellar","interval","intervention","intimate","intimacy","intoxication","intrepid","intricate","intricately","intrigue","intriguing","intrinsic","introspective","intrusion","intruder","intruding","inundate","invade","invasion","invader","invariably","inventory","invertebrate","vertebrate","investigate","investigation","inviting","involuntary","ion","irony","ironic","irregular","irregularly","irrelevant","irreparable","irresistible","irresponsible","irreverent","irreverence","irreversible","irrevocable","irrigate","irrigation","irritate","irritable","irritating","isolate","isolated","isolation","issue","itinerary","itinerant","jar","ajar","jealousy","jelly","jellyfish","jewel","jewelry","jeweler","jibe with","jog","jogging","jolt","jolting","journal","journalist","journalistic","journalism","jubilant","judgement","judicious","juice","juicy","jumble","junction","juncture","jungle","jurisdiction","jury","injury","judgement","verdict","sentence","justify","justice","injustice","justly","juvenile","juxtaposition","keen","ken","kennel","kernel","kerosene","gasoline","kiln","kinetic","kingdom","laborious","laboriously","laborer","labor movement","labor union","labyrinth","lace","lag","lament","landing","landmass","landscape","landslide","largely","larvae","larynx","laser","lash","splash","flash","lasting","long-lasting","everlasting","latent","lateral","equilateral triangle","quadrilateral","bilateral","latitude","platitude","launch","laundry","laurels","lava","volcano","lave","lavish","slavish","lawn","lawsuit","lay","layer","layering","layman","layout","leading","mislead","leadership","league","colleague","leak","leaky","bleak","leap","learn by rote","lease","ledge","pledge","legacy","heritage","legendary","legend","legible","illegible","legislation","legislate","legislature","legume","leisure","leisurely","lengthen","lengthy","leopard","lethal","lethargic","lethargy","lettuce","liable of","libel","liberal","liberate","liberty","liberally","deliberate","life span","lift","facelift","light bulb","bulb","likewise","limb","limestone","lineage","linen","linger","linguistic","linguistics","liquid","literally","literary","literate","literacy","illiterate","semiliterate","obliterate","iterate","litter","litter…with…","livelihood","lively","liver","livestock","living quarters","load","unload","overload","shipload","trainload","workload","loathsome","lobby","lobster","locate","location","locality","locally","locomote","locomotion","locomotive","lodge","lodging","log n.","log cabin","logical","logic","long-range","longevity","longitude","loom","bloom","loop","sloop","loose","loosen","lore","lucrative","lull","lumber","lumbering","timber","slumber","plumber","luminosity","luminous","lunar","lure","luster","lustrous","luxurious","luxury","lyric","lyricist","lyrically","magic","magical","magician","magnesium","magnetic","magnetic","magnetism","magnetize","demagnetize","ferromagnetic","geomagnetic","electromagnetic","magnificent","magnificence","magnify","magnitude","maintenance","maize","corn","popcorn","cornet","majestic","majesty","majority","makeup","malfunction","mall","mallet","malleable","malleability","malnutrition","mammal","mammoth","mandatory","mandate","maneuver","mania","manifestation","manipulate","mannerism","mansion","mantle","manual","manually","manure","map","marble","march","margin","marine","aquamarine","submarine","maritime","markedly","marrow cavity","marsh","marshy","marvel","marvelous","mask","mason","stonemason","masonry","massive","masterpiece","matching","matchless","mate","mathematics","maverick","meager","meaningful","measures","mechanical","mechanics","mechanized","mechanism","media","mediate","intermediate","mediator","medieval","medium","melodious","melody","melodic","melodrama","membrane","memo","memory","memorize","memorable","commemorate","memorandum","memorial","menace","mend","amendment","recommend","mention","menu","mercantile","merchant","merchandise","merge","merger","emerge","emergence","meridian","merit","mesmerize","messy","metabolism","metabolic","metaphor","meteor","meteorite","meteorology","meteorologist","methodology","methodically","meticulous","metropolitan","microbe","microcosm","microorganism","microscope","microscopic","telescope","microwave","mighty","migrant","emigrant","immigrant","migrate","migration","migratory","milestone","milieu","militant","millennia","millionaire","mime","mimetic","mimicry","mimic","mingle","mingling","miniature","minimize","minimal","minimalist","minimum","minority","minuscule","minute","miraculous","miracle","mirage","miserable","mislead","misleading","mistrust","mistrustful of","mitigate","moat","mobile","mobility","immobile","mock","mockingbird","moderate","modest","modify","moist","moisten","moisture","mold","molecule","molecular","molten","monarch","monetary","monitor","monochromatic","monopolize","monopoly","monotonous","monster","monument","mounmental","morale","morphololgy","mortal","most distinctive","motifn","motion","motionless","locomotion","motivate","motivation","motive","locomotive","automotive","mourning","mournful","mouth","mud mortar","mortar","mulberry","multicellular","multi-faceted","multiple","multiply","multistory","multitude","mundane","municipal","mural","muscular","mushroom","mutual","myriad","mysterious","myth","mythical","mythology","naive","naked","narcotic","narrator","native to","natural gas","naturalist","naturalistic","naval","navigate","navigation","neat","underneath","beneath","needy","negative","negate","neglect","negligent","negligible","negotiation","neoclassical","neon","nerve cord","spinal cord","neuron","nervous","neutral","neutralize","neutron","niche","nickel","dime","nicotine","nocturnal","noisy","nomadic","nominate","nominee","nonconformist","nonetheless","nonprofessional","nonsense","nontraditional adj","norm","normal","normally","abnormal","nostalgia","not…so much as…","not as yet","notable","notably","notate","notation","notch","note","notorious","notoriously","nourish","nourishing","nourishment","novel","novelty","novice","nowadays","now and then","noxious","nuclear","nuclei","nucleus","null","numerous","nutrient","nutritional","nutritious","oath","object to","objection","objective","obligated","obligation","obligatory","oblige","obliterate","obscure","obsession","obsessed","obsolete","obstacle","obstruct","obstruction","unobstructed","obtain","obtainable","occasional","occasionally","occupation","occupy","occupant","occur","occurrence","octopus","odd","oddly","odds","odor","deodorizer","odorless","of scale","offensive","inoffensive","offshore","offspring","olfactory","omit","ongoing","onset","onslaught","ooze","opaque","opera","opponent","opportunity","opposed","opposing","opposition","opposite","optical","optometrist","optimal","optimum","optimist","optimistic","optional","option","oral","oratorio","orbit","orbital","orchard","orchestra","orchid","ordeal","ordinance","ore","roe","organic","organically","organism","microorganism","orientation","orient","oriental","original","originality","originate","ornament","ornamentation","ornamental","ounce","renounce","pronounced","denounce","bounce","announce","oust","outbreak","outcome","outcry","outdated","outdoors","outermost","outfit","outgoing","outgrow","outgrowth","outlast","outlet","outlook","outlying","outmoded","output","outrage","outright","outset","outspoken","outweigh","oval","overall","overburden","overcast","overcharge","overdue","overhaul","haul","overlap","overlapping","overload","overlook","oversee","oversight","overt","overtime","overtire","overtax","overtaxed","overturn","overwhelm","overwhelmingly","owing to","oxen","oxygen","oyster","pack","pack down","pack animal","packed","package","packaging","packer","backpack","unpack","paddler","painstaking","painting","palatable","unpalatable","pale","palette","paleontologist","pamphlet","pane","panel","panic","Hispanic","pants","rampant","parachute","parade","parallel","unparalleled","paralysis","paralyze","parameter","paramount","paraphrase","parasite","parasitic","parliamentary","partial","impartially","participant","particle","passion","passionate","passive","pastel","pasture","patch","dispatch","patent","path","pathway","footpath","pathogen","patriarch","patriarchal","patriot","patriotic","patrol","patroller","patron","patronage","patronizing","paucity","pauper","pave","pave the way for","peak","pebble","peck","peculiar","peculiarity","pedagogy","pedagogic","pedagogical","peer","peerless","penal","penalty","penchant","pendant","penetrate","penetrating","peninsula","pensive","perceive","perception","perceptive","conception","misconception","perch","percolate","percussion","perennial","perennially","perfect","perfection","perform","performance","performer","perfume","perimeter","periodic","period","periodical","peripheral","periphery","perishable","permanent","permeate","permeable","permission","permissive","perpendicular","perpetuate","perplex","perplexing","persevere","perseverance","persist","persistence","persistent","personality","personnel","perspective","perspiration","perspire","persuade","persuasive","pertinent","pest","pesticide","pestilence","pestilential","pet","petal","petition","repetition","competition","petroleum","phase","phenomena","phenomenally","philology","philosophy","phonetics","physiological","physiology","picturesque","pierce","pigment","pillar","caterpillar","capillary","pillow","willow","pinch","pine","porcupine","pineapple","spine","spined","spinet","pinpoint","pioneer","pioneering","pique","pit","pitch","pitcher","pivot","pivotal","a pivotal figure","plagiarism","plague","plain","plainly","plainspoken","floodplain","planet","plank","chunk","plantation","plasma","plaster","plate","platelike","tinplate","plateau","platform","platitude","platitudinous","playwright","pleasing","pleasure","pledge","pliable","pliant","plight","plow","plumage","plumb","plumber","plumbing","plump","plunge","pocketbook","polarize","polish","ploished","politics","poll","pollinate","pollination","pollen","pollinator","pollute","pollution","pollutant","polygon","polygonal","popular","popular tune","popularity","populous","porcelain","pore","pole","tadpole","porous","portable","portend","portion","portrait","portraitist","portraiture","portray","portrayal","pose","posture","positive","negative","possess","possession","post","poster","postmaster","postage","postal","postal service","postcard","postdate","antedate vt.","postgraduate","postwar","postoperative","posthumous","postpone","postulate","pot","coffeepot","teapot","pottery","potter","potted","potent","potential","potentiality","pound","poverty","propery","practicable","practical","practically","practicality","inpractical","impracticality","prairie","preach","precarious","precaution","precede","precedent","unprecedented","preceding","precious","precipitate","precipitation","precipitous","precision","precursor","predatory","predator","depredation","predecessor","predict","prediction","predictive","predictable","predictability","predominate","predominant","predominantly","preeminent","eminent","prefabricated","preferable","preference","pregnant","prehistoric","preliminary","premature","premium","preoccupation","preponderance","prerequisite","prescribe","prescribed","prescription","presence","preserve","preservative","preservation","presidency","presidential election","preside over","pressure","prestige","prestigious","presumably","pretension","prevailing","prevail","prevalent","prey","osprey","primal","primate","prime","primary","prime number","heyday","primitive","primordial","priority","pristine","privilege","probe","proceed","proceeds","proceeding","process","proclaim","proclivity","prod","prodigious","prodigy","produce","profession","professional","professionalism","proficient","proficiency","profile","profound","profoundly","progress","progression","progressive","prohibit","prohibitive","prohibitively","project","projecting","projector","projection","projectionist","proliferate","proliferation","prolific","prolong","prominent","prominence","promising","unpromising","compromise","promote","promoter","prompt","prone","pronounced","proof","proofread","fireproof","waterproof","soundproof","rustproof","propagate","propel","propellant","propensity","proper","property","proponent","opponent","proportion","disproportionate","propose","proposal","proprietor","proprietorship","propulsion","prose","prosecute","prospect","prospecting","prospector","prosper","prosperity","prosperous","protagonist","protectionist","protein","protest","prototype","protruding","provincialism","provision","provoke","provocative","provocation","prudent","pry open","psychology","parapsychology","publicize","publicity","puddle","pueblo","pulp","pulse","impulse","pump","pumpkin","punch","puncture","acupuncture","pungent","pupil","purple","purify","purified","purification","puzzle","puzzling","pyramid","quail","quaint","acquaint","acquaintance","acquainted","qualified","qualification","quantitative","quantum theory","quarry","quarter","quarterly","headquarters","quartz","quench","quest","questionable","questionnaire","unquestioning","unquestionably","request","bequest","sequester","equestrian","quiescent","quilt","quilter","quail","quota","quotation","radar","radiant","radiate","irradiate","radiation","radical","radically","sporadically","raft","graft","craft","aircraft","spacecraft","hovercraft","rage","coverage","news coverage","outrage","enrage","mirage","sewerage","forage","ragged","ragtime","raid","braid","rainfall","rally","rampant","ranch","ranching","rancher","range","a range of","range","rank","rare","rarefy","rarely","ratify","ration","rationing","rational","rattle","rattlesnake","raucous","raven","ravine","ray","rayon","crayon","fray","foray","tray","array","betray","spray","raze","graze","craze","readily","readjust","realization","realm","reap","rear","rebel","rebellion","rebellious","rebuke","recall","receptacle","reception","receptionist","receptive","receptor","recession","recipe","recipient","recital","reckless","reckon","reclaim","recognize","recognition","recoil","recollection","recommend","recommendation","reconstruct","reconstruction","recount","recreation","recreational","recruit","rectangle","rectangular","rectify","recur","recurring","recycle","redirect","reed","refine","refined","refinement","reflection","reform","reformer","reformism","refraction","refreshing","refreshment","refrigerate","refrigerator","refrigeration","refrigerant","refurbish","refute","regardless","regardless of","regenerate","regeneration","regime","regimentation","register","regulate","regulatory","regulation","rehabilitate","rehabilitation","rehearse","reign","reigning","sovereignty","reimburse","reinforce","reinterpretation","reiterate","reject","rejection","rejuvenate","rekindle","relax","relaxed","relaxation","relay","release","relevant","relevance","nonrelevant","irrelevant","reliable","reliant","reliance","reliability","relic","relieve","relieved","religion","religious","reluctant","remainder","remaining","remark","remarkable","remarkably","remedy","remind","reminder","remnant","romote","renaissance","render","rendering","surrender","rendition","renew","renewal","renewable","renounce","renunciation","renovate","renovation","rent","rentable","rental","reorient","repel","repertoire","repertory","repetition","replace","replenish","replica","replicate","represent","representation","representative","repress","reproductive","reproduce","reproduction","reptile","repulse","repute","reputed","disrepute","rescue","resemble","resemblance","resent","resentful","reserve","be reserved to","preserve","reservoir","reside","resident","residential","residence","residue","residual","resist","resistant","resistance","irresistible","resolute","resolve","resolution","resonance","resort","resource","respect","aspect","disrespect","respective","respectively","respiration","respiratory","respond","correspond","correspondence","corresponding","responsible","responsibility","irresponsible","responsive","restore","restoration","restraint","restrain","unrestrained","restrict","restriction","restrictive","unrestricted","retail","retailer","tailor","retain","retentive","retire","retirement","retool","retract","retreat","retrieve","retriever","retrospect","retrospective","reveal","revere","revered","reverently","irreverent","irreverence","reverse","reversible","irreversible","revise","revision","revitalization","revive","revival","revolt","revolutionize","revolution","revolutionary","rhetoric","rhythm","rhythmic","rhythmical","ridge","ridiculous","ridicule","rifle","rift","drift","driftwood","snowdrift","rigid","frigid","rigidity","rigorous","rigor","rinse","riot","rip","drip","dripstone","ripe","ripen","risky","frisky","briskness","rite","ritual","rival","rivalry","roam","roar","roast","robust","rod","role","roll","roost","rooster","rotate","rotation","rote","rough","roughly","routine","routinely","rubbery","rubble","pebble","rudimentary","rugged","ruin","ruins","rumble","rupture","rural","urban","rust","rustic","rustproof","sac","sack","knapsack","sacred","saddle","saga","sake","salient","saline","saliva","salinity","saltiness","desalination","sample","sanctimonious","sanction","sanctuary","infirmary","sandy","sanitation","sanitary","sap","sapphire","sarcastic","satire","satiric","satirist","satisfactory","unsatisfactory","saturate","saturated","saucer","save","savings","lifesaver","scale","scaled","upscale","scan","scapegoat","scarce","scarcely","scare","scarlet","scatter","scavenger","scene","scenery","scenic","scent","ascent","descent","quiescent","incandescent","fluorescent","adolescent","schedule","reschedule","scheme","scholar","scholarship","scholarly","scissors","scope","microscope","telescope","score","scotch","Scotch","scour","scout","scramble","amble","scrap","scrape","vi.","scraping","scratch","screen","screw","screwdriver","scruple","scrupulously","unscrupulously","scuba","sculpture","sculpt","sculptor","sculptural","sea cucumber","cucumber","seam","seamen","seabed","seamount","seaport","seashore","seaweed","seasoning","seasonal","unseasonably","seclusion","seclude","secondary","secrete","secretin","oversecretion","secret","sect","sector","section","sectional","subsection","intersected","intersection","secular","secure","securely","security","sedentary","sediment","sedimentary","seduce","seedling","seemingly","segment","segregate","seismic","seismology","seismograph","selection","self-sufficient","semimolten","semester","senator","sensational","sensation","sensible","sensibility","sensitive","sensitivity","hypersensitive","photosensitive","sensory","sentimental","sentimentalize","sentimentalism","sequence","consequence","serene","serious","seriously","serrated","setting","set 